app/views/tweeets/_profile.html.erb

SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC
SELECT COUNT(*) FROM "tweeets" WHERE "tweeets"."user_id" = ?  [["user_id", 2]]
---
						<p class="heading">Tweeets</p>
						<p class="title is-6"><%= current_user.tweeet.count %></p>