app/controllers/tweeets_controller.rb

  def index
    @tweeets = Tweeet.all
---
SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC

  def create
    @tweeet = Tweeet.new(tweeet_params)

    respond_to do |format|
      if @tweeet.save
---
INSERT INTO "tweeets" ("tweeets", "created_at", "updated_at") VALUES (?, ?, ?)  [["tweeets", "Abdoulaye"], ["created_at", "2020-06-13 13:27:17.872065"], ["updated_at", "2020-06-13 13:27:17.872065"]]

    def set_tweeet
      @tweeet = Tweeet.find(params[:id])
---
SELECT  "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]